Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM3204PL10028.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>OSC32KCTRL</name>
         <version>06251v1</version>
         <description>32.768 kHz Oscillators Controller</description>
         <baseAddress>0x40001400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x30</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SYSTEM</name>
            <value>0</value>
         </interrupt>
         <registers>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x4</addressOffset>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KRDY</name>
                     <description>OSC32K Ready Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKFAIL</name>
                     <description>XOSC32K Clock Failure Detection Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x8</addressOffset>
               <modifiedWriteValues>oneToSet</modifiedWriteValues>
               <fields>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KRDY</name>
                     <description>OSC32K Ready Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKFAIL</name>
                     <description>XOSC32K Clock Failure Detection Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0xC</addressOffset>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KRDY</name>
                     <description>OSC32K Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKFAIL</name>
                     <description>XOSC32K Clock Failure Detected</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAGSET</name>
               <description>Interrupt Flag Software Set</description>
               <addressOffset>0x10</addressOffset>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KRDY</name>
                     <description>OSC32K Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKFAIL</name>
                     <description>XOSC32K Clock Failure Detected</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x14</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>XOSC32KRDY</name>
                     <description>XOSC32K Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KRDY</name>
                     <description>OSC32K Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKFAIL</name>
                     <description>XOSC32K Clock Failure Detected</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKSW</name>
                     <description>XOSC32K Clock Switch</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTCCTRL</name>
               <description>RTC Control</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>RTCSEL</name>
                     <description>RTC Clock Source Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RTCSELSelect</name>
                        <enumeratedValue>
                           <name>OSC1K</name>
                           <description>1.024 kHz from the internal 32.768 kHz oscillator</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSC32K</name>
                           <description>32.768 kHz from the internal 32.768 kHz oscillator</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XOSC1K</name>
                           <description>1.024 kHz from the external 32.768 kHz crystal oscillator</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XOSC32K</name>
                           <description>32.768 kHz from the external 32.768 kHz crystal oscillator</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>XOSC32KCTRL</name>
               <description>XOSC32K Control</description>
               <addressOffset>0x1C</addressOffset>
               <resetValue>0x00000080</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Oscillator Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XTALEN</name>
                     <description>External Source Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>XTALENSelect</name>
                        <enumeratedValue>
                           <name>EXTCLK</name>
                           <description>External Clock on the XTAL32K1 pin. XTAL32K2 is available for other functions. The CSUT timer is disregarded, and no start-up time is used.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XTAL</name>
                           <description>External Crystal connected to the XTAL32K1 and XTAL32K2 pins</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On-Demand Operation</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSUT</name>
                     <description>Crystal Oscillator Start-Up Time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CSUTSelect</name>
                        <enumeratedValue>
                           <name>1K</name>
                           <description>1K XOSC32K cycles</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16K</name>
                           <description>16K XOSC32K cycles</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32K</name>
                           <description>32K XOSC32K cycles</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>64K</name>
                           <description>64K XOSC32K cycles</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPMODE</name>
                     <description>Low Power Mode</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRTLOCK</name>
                     <description>Write Lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFDCTRL</name>
               <description>Clock Failure Detector Control</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>CFDEN</name>
                     <description>Clock Failure Detector Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWBACK</name>
                     <description>Clock Switch Back Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFDPRESC</name>
                     <description>Clock Failure Detector Prescaler</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>CFDEO</name>
                     <description>Clock Failure Detector Event Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSC32KCTRL</name>
               <description>32.768 kHz Internal Oscillator (OSC32K) Control</description>
               <addressOffset>0x28</addressOffset>
               <resetValue>0x00000080</resetValue>
               <fields>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On-Demand Operation</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRTLOCK</name>
                     <description>Write Lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPCTRL</name>
               <description>Write Protection Control</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPLCK</name>
                     <description>Write Protection Lock</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>KEY</name>
                           <description>Allow writes to the WPCTRL register</description>
                           <value>0x4F5343</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
