Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM3204PL10028.svd
                        <description>Event 2 Pin Identifier</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>5</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>PID2Select</name>
                           <enumeratedValue>
                              <name>PIN0</name>
                              <description>Event actions will be executed on pin 0</description>
                              <value>0x00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN1</name>
                              <description>Event actions will be executed on pin 1</description>
                              <value>0x01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN2</name>
                              <description>Event actions will be executed on pin 2</description>
                              <value>0x02</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN3</name>
                              <description>Event actions will be executed on pin 3</description>
                              <value>0x03</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN4</name>
                              <description>Event actions will be executed on pin 4</description>
                              <value>0x04</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN5</name>
                              <description>Event actions will be executed on pin 5</description>
                              <value>0x05</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN6</name>
                              <description>Event actions will be executed on pin 6</description>
                              <value>0x06</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN7</name>
                              <description>Event actions will be executed on pin 7</description>
                              <value>0x07</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN8</name>
                              <description>Event actions will be executed on pin 8</description>
                              <value>0x08</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN9</name>
                              <description>Event actions will be executed on pin 9</description>
                              <value>0x09</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN10</name>
                              <description>Event actions will be executed on pin 10</description>
                              <value>0x0A</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN11</name>
                              <description>Event actions will be executed on pin 11</description>
                              <value>0x0B</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN12</name>
                              <description>Event actions will be executed on pin 12</description>
                              <value>0x0C</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN13</name>
                              <description>Event actions will be executed on pin 13</description>
                              <value>0x0D</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN14</name>
                              <description>Event actions will be executed on pin 14</description>
                              <value>0x0E</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN15</name>
                              <description>Event actions will be executed on pin 15</description>
                              <value>0x0F</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN16</name>
                              <description>Event actions will be executed on pin 16</description>
                              <value>0x10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN17</name>
                              <description>Event actions will be executed on pin 17</description>
                              <value>0x11</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN18</name>
                              <description>Event actions will be executed on pin 18</description>
                              <value>0x12</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN19</name>
                              <description>Event actions will be executed on pin 19</description>
                              <value>0x13</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN20</name>
                              <description>Event actions will be executed on pin 20</description>
                              <value>0x14</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN21</name>
                              <description>Event actions will be executed on pin 21</description>
                              <value>0x15</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN22</name>
                              <description>Event actions will be executed on pin 22</description>
                              <value>0x16</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN23</name>
                              <description>Event actions will be executed on pin 23</description>
                              <value>0x17</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN24</name>
                              <description>Event actions will be executed on pin 24</description>
                              <value>0x18</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN25</name>
                              <description>Event actions will be executed on pin 25</description>
                              <value>0x19</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN26</name>
                              <description>Event actions will be executed on pin 26</description>
                              <value>0x1A</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN27</name>
                              <description>Event actions will be executed on pin 27</description>
                              <value>0x1B</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN28</name>
                              <description>Event actions will be executed on pin 28</description>
                              <value>0x1C</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN29</name>
                              <description>Event actions will be executed on pin 29</description>
                              <value>0x1D</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN30</name>
                              <description>Event actions will be executed on pin 30</description>
                              <value>0x1E</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN31</name>
                              <description>Event actions will be executed on pin 31</description>
                              <value>0x1F</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EVACT2</name>
                        <description>Event 2 Action</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>EVACT2Select</name>
                           <enumeratedValue>
                              <name>OUT</name>
                              <description>The output value of pin PIDn will be set to the level of the event</description>
                              <value>0x00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SET</name>
                              <description>Set the output value of pin PIDn on the rising edge of the event</description>
                              <value>0x01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLR</name>
                              <description>Clear the output value of pin PIDn on the rising edge of the event</description>
                              <value>0x02</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TGL</name>
                              <description>Toggle the output value of pin PIDn on the rising edge of the event</description>
                              <value>0x03</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PORTEI2</name>
                        <description>PORT Event 2 Input Enable</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PID3</name>
                        <description>Event 3 Pin Identifier</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>5</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>PID3Select</name>
                           <enumeratedValue>
                              <name>PIN0</name>
                              <description>Event actions will be executed on pin 0</description>
                              <value>0x00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN1</name>
                              <description>Event actions will be executed on pin 1</description>
                              <value>0x01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN2</name>
                              <description>Event actions will be executed on pin 2</description>
                              <value>0x02</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN3</name>
                              <description>Event actions will be executed on pin 3</description>
                              <value>0x03</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN4</name>
                              <description>Event actions will be executed on pin 4</description>
                              <value>0x04</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN5</name>
                              <description>Event actions will be executed on pin 5</description>
                              <value>0x05</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN6</name>
                              <description>Event actions will be executed on pin 6</description>
                              <value>0x06</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN7</name>
                              <description>Event actions will be executed on pin 7</description>
                              <value>0x07</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN8</name>
                              <description>Event actions will be executed on pin 8</description>
                              <value>0x08</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN9</name>
                              <description>Event actions will be executed on pin 9</description>
                              <value>0x09</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN10</name>
                              <description>Event actions will be executed on pin 10</description>
                              <value>0x0A</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN11</name>
                              <description>Event actions will be executed on pin 11</description>
                              <value>0x0B</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN12</name>
                              <description>Event actions will be executed on pin 12</description>
                              <value>0x0C</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN13</name>
                              <description>Event actions will be executed on pin 13</description>
                              <value>0x0D</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN14</name>
                              <description>Event actions will be executed on pin 14</description>
                              <value>0x0E</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN15</name>
                              <description>Event actions will be executed on pin 15</description>
                              <value>0x0F</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN16</name>
                              <description>Event actions will be executed on pin 16</description>
                              <value>0x10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN17</name>
                              <description>Event actions will be executed on pin 17</description>
                              <value>0x11</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN18</name>
                              <description>Event actions will be executed on pin 18</description>
                              <value>0x12</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN19</name>
                              <description>Event actions will be executed on pin 19</description>
                              <value>0x13</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN20</name>
                              <description>Event actions will be executed on pin 20</description>
                              <value>0x14</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN21</name>
                              <description>Event actions will be executed on pin 21</description>
                              <value>0x15</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN22</name>
                              <description>Event actions will be executed on pin 22</description>
                              <value>0x16</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN23</name>
                              <description>Event actions will be executed on pin 23</description>
                              <value>0x17</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN24</name>
                              <description>Event actions will be executed on pin 24</description>
                              <value>0x18</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN25</name>
                              <description>Event actions will be executed on pin 25</description>
                              <value>0x19</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN26</name>
                              <description>Event actions will be executed on pin 26</description>
                              <value>0x1A</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN27</name>
                              <description>Event actions will be executed on pin 27</description>
                              <value>0x1B</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN28</name>
                              <description>Event actions will be executed on pin 28</description>
                              <value>0x1C</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN29</name>
                              <description>Event actions will be executed on pin 29</description>
                              <value>0x1D</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN30</name>
                              <description>Event actions will be executed on pin 30</description>
                              <value>0x1E</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PIN31</name>
                              <description>Event actions will be executed on pin 31</description>
                              <value>0x1F</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EVACT3</name>
                        <description>Event 3 Action</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>EVACT3Select</name>
                           <enumeratedValue>
                              <name>OUT</name>
                              <description>The output value of pin PIDn will be set to the level of the event</description>
                              <value>0x00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SET</name>
                              <description>Set the output value of pin PIDn on the rising edge of the event</description>
                              <value>0x01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLR</name>
                              <description>Clear the output value of pin PIDn on the rising edge of the event</description>
                              <value>0x02</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TGL</name>
                              <description>Toggle the output value of pin PIDn on the rising edge of the event</description>
                              <value>0x03</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PORTEI3</name>
                        <description>PORT Event 3 Input Enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
