Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM3204PL10028.svd
            <cluster>
               <name>SPI</name>
               <description>SPI Mode</description>
               <alternateCluster>I2CM</alternateCluster>
               <headerStructName>SercomSpi</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>SPI Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>3</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>USART_EXT</name>
                              <description>USART with external clock</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART_INT</name>
                              <description>USART with internal clock</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_SLAVE</name>
                              <description>SPI Client mode</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_MASTER</name>
                              <description>SPI Host mode</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_SLAVE</name>
                              <description>I2C Client mode</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_MASTER</name>
                              <description>I2C Host mode</description>
                              <value>0x5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run In Standby</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IBON</name>
                        <description>Immediate Buffer Overflow Notification</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DOPO</name>
                        <description>Data Out Pinout</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DOPOSelect</name>
                           <enumeratedValue>
                              <name>MUX0</name>
                              <description>PAD[0]=DO, PAD[1]=SCK, PAD[2]=SS</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MUX1</name>
                              <description>PAD[2]=DO, PAD[3]=SCK, PAD[1]=SS</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MUX2</name>
                              <description>PAD[3]=DO, PAD[1]=SCK, PAD[2]=SS</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MUX3</name>
                              <description>PAD[0]=DO, PAD[3]=SCK, PAD[1]=SS</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DIPO</name>
                        <description>Data In Pinout</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DIPOSelect</name>
                           <enumeratedValue>
                              <name>MUX0</name>
                              <description>SERCOM PAD[0] is used as data input</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MUX1</name>
                              <description>SERCOM PAD[1] is used as data input</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MUX2</name>
                              <description>SERCOM PAD[2] is used as data input</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MUX3</name>
                              <description>SERCOM PAD[3] is used as data input</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>FORM</name>
                        <description>Frame Format</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>FORMSelect</name>
                           <enumeratedValue>
                              <name>SPI_FRAME</name>
                              <description>SPI Frame</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_FRAME_WITH_ADDR</name>
                              <description>SPI Frame with Address</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CPHA</name>
                        <description>Clock Phase</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>CPHASelect</name>
                           <enumeratedValue>
                              <name>LEADING_EDGE</name>
                              <description>The data is sampled on a leading SCK edge and changed on a trailing SCK edge</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TRAILING_EDGE</name>
                              <description>The data is sampled on a trailing SCK edge and changed on a leading SCK edge</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CPOL</name>
                        <description>Clock Polarity</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>CPOLSelect</name>
                           <enumeratedValue>
                              <name>IDLE_LOW</name>
                              <description>SCK is low when IDLE. The leading edge of a clock cycle is a rising edge, while the trailing edge is a falling edge.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>IDLE_HIGH</name>
                              <description>SCK is high when IDLE. The leading edge of a clock cycle is a falling edge, while the trailing edge is a rising edge.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DORD</name>
                        <description>Data Order</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DORDSelect</name>
                           <enumeratedValue>
                              <name>MSB</name>
                              <description>MSb is transferred first</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LSB</name>
                              <description>LSb is transferred first</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>SPI Control B</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>CHSIZE</name>
                        <description>Character Size</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>CHSIZESelect</name>
                           <enumeratedValue>
                              <name>8_BIT</name>
                              <description>Eight bits</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>9_BIT</name>
                              <description>Nine bits</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PLOADEN</name>
                        <description>Client Data Preload Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSDE</name>
                        <description>SPI Select Low Detect Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MSSEN</name>
                        <description>Host SPI Select Enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AMODE</name>
                        <description>Address Mode</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>AMODESelect</name>
                           <enumeratedValue>
                              <name>MASK</name>
                              <description>ADDRMASK is used as a mask to the ADDR register</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2ADDRS</name>
                              <description>The client responds to the two unique addresses in ADDR and ADDRMASK</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RANGE</name>
                              <description>The client responds to the range of addresses between and including ADDR and ADDRMASK with ADDR as the upper limit</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RXEN</name>
                        <description>Receiver Enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD</name>
                  <description>SPI Baud Rate</description>
                  <addressOffset>0xC</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Register</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>SPI Interrupt Enable Clear</description>
                  <addressOffset>0x14</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSL</name>
                        <description>SPI Select Low Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Error Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>SPI Interrupt Enable Set</description>
                  <addressOffset>0x16</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSL</name>
                        <description>SPI Select Low Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Error Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>SPI Interrupt Flag Status and Clear</description>
                  <addressOffset>0x18</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSL</name>
                        <description>SPI Select Low</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Error</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>SPI Status</description>
                  <addressOffset>0x1A</addressOffset>
                  <size>16</size>
                  <fields>
                     <field>
                        <name>BUFOVF</name>
                        <description>Buffer Overflow</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>SPI Synchronization Busy</description>
                  <addressOffset>0x1C</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>SERCOM Enable Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTRLB</name>
                        <description>CTRLB Synchronization Busy</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
